In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
###make a series from an array

arr = np.array([1, 2, 3, 4, 5, 6])
ser = pd.Series(arr)
ser

In [ ]:
###arr = np.array([1, 2, 3, 4, 5, 6])
###ser = pd.Series(arr, index = ["A", "B", "C", "D", "E", "F"])
###ser

In [ ]:
###make a series from a dictionary

dic = {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5, "F": 6}
ser = pd.Series(dic)
ser

In [ ]:
###dic = {'A' : 1, 'B' : 2, 'C' : 3}
###ser = pd.Series(dic, index = ['B', 'C', 'D'])
###print(ser)

In [ ]:
###dic = {'A' : 1, 'B' : 2, 'C' : 3}
###ser = pd.Series(dic, index = ['B', 'D', 'C', 'D'])
###ser

In [ ]:
#make a dataframe from array

array = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
index_values = ['first', 'second', 'third']
column_values = ['number', 'squares', 'cubes']
df = pd.DataFrame(data = array,
                 index = index_values,
                 columns = column_values)
df

In [ ]:
#array = np.array([['Siddhi', 27], ['Sushil', 28], ['Himanshu', 26]])
#index_values = ['A', 'B', 'C']
#column_values = ['Name', 'Age']
#df = pd.DataFrame(data = array,
#                 index = index_values,
 #                columns = column_values)
#df

In [ ]:
##adding third column
#array = np.array([['Siddhi', 27, 'November'], ['Sushil', 28, 'July'], ['Himanshu', 26, 'March'],['Kenisha', 28, 'September']])
#index_values = ['A', 'B', 'C', 'D']
#column_values = ['Name', 'Age', 'Birth_Month']
#df = pd.DataFrame(data = array,
 #                index = index_values,
 #                columns = column_values)
#df

In [ ]:
###make a DataFrame from an dictionary

data = {
    'cloths' : ['Jeans', 'Tops', 'Shirt'],
    'color' : ['Blue', 'Black', 'White'],
    'size' : ['L', 'S', 'XL']
}
df = pd.DataFrame(data)
df

In [ ]:
### with index

###data = {
###    'cloths' : ['Jeans', 'Top', 'Shirt'],
###    'color' : ['Blue', 'Black', 'White'],
###    'size' : ['L', 'S', 'XL']
###}
##df = pd.DataFrame(data, index = ["my_cloths", "fav_color", "my_size"])
##df

In [ ]:
#data = {
 #  'Siddhi' : 27,
  #  'Heer' : 12,
   # 'Aahan' : 4
#}
#df = pd.DataFrame(list(data.items()))
#df

In [ ]:
#required columns only

#data = {
 #   'cloths' : ['Jeans', 'Tops', 'Shirt'],
  #'color' : ['Blue', 'Black', 'White'],
   # 'size' : ['L', 'S', 'XL']
#}
#df = pd.DataFrame(data, columns = ['cloths', 'color'])
#df

In [ ]:
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak', 'Abhinav', 'Urvish', 'Kenisha','Pinal', 'Heeral'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA','Python', 'Python', 'DS', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83, 66, 59, 87, 47, 55]
}
df = pd.DataFrame(data)
df

In [ ]:
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83]
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

In [ ]:
###df = pd.DataFrame(data, index = 'I','II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X')
####df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'])

In [ ]:
df[["Total Marks"]]

In [ ]:
print(df[["Name of Students","Total Marks"]])

In [ ]:
df[1:4]

In [ ]:
df[2:3]

In [ ]:
df[1:3]

In [ ]:
df[:2:]

In [ ]:
import numpy as np
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ["Data Science", 'Data Analytics', 'Python', 'Data Science', 'Data Analytics'],
    'Total Marks' : [ 77, 80, 93, 79, 83]
    
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

In [ ]:
df.loc['F'] = ['Janu', 'Data Science', 77]

In [ ]:
df.loc['G'] = ['Dhruv', np.nan, 91]

In [ ]:
df.loc['H'] = ['Dipti', 'DA', 97]

In [ ]:
df

In [ ]:
##df['DOJ'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [ ]:
df

In [ ]:
###df = df.drop(['DOJ'], axis = 1)

In [ ]:
ag = [20, 22, 24, 27, 17, 12, 10, 25]
df['Age'] = ag
df

In [ ]:
df

In [ ]:
df['Age']>20

In [ ]:
df[df['Age']>20]

In [ ]:

df = df.drop(['D'], axis=0)
df

In [ ]:
df[['Name of Students', 'Course Name', 'Total Marks']].loc['B': 'F']

In [ ]:
df['Name of Students'].loc['B': 'E']

In [ ]:
df.loc([0], ['Name of Students'])
df

In [ ]:
df.loc[['B', 'E']]  ##select only b and e

In [ ]:
df['Total Marks']>80

In [ ]:
df.loc['C']

In [ ]:
df[df['Total Marks']>80]

In [ ]:
df['Total Marks']

In [ ]:
df[df['Course Name'] == 'Data Science']

In [ ]:
df[df['Course Name'] == 'Python']

In [ ]:
df[df['Course Name'] == 'Data Analytics']

#

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('pandasss.xlsx')

In [3]:
df1

   col1  col2
0     1    45
1     2    54
2     3     7
3     4     8
4     5    45
5     6    98
6     7    77
7     8    52
8     9    98
9    10    45

In [4]:
df = pd.DataFrame([[10, 20, 30],
                  [40, 50, 60],
                  [70, 80, 90],
                  [100, 110, 120]],
columns = ['Col_A', 'Col_B', 'Col_C'])
df

   Col_A  Col_B  Col_C
0     10     20     30
1     40     50     60
2     70     80     90
3    100    110    120

In [7]:
df.agg(['sum', 'min'])

     Col_A  Col_B  Col_C
sum    220    260    300
min     10     20     30

In [8]:
df.agg(['sum', 'min', 'max'])

     Col_A  Col_B  Col_C
sum    220    260    300
min     10     20     30
max    100    110    120

In [12]:
df.agg({'Col_A' : ['sum', 'min'],
        'Col_B' : ['max', 'min']})

     Col_A  Col_B
sum  220.0    NaN
min   10.0   20.0
max    NaN  110.0

In [13]:
df.agg({'Col_A' : ['max'],
       'Col_C' : ['min','sum']})

     Col_A  Col_C
max  100.0    NaN
min    NaN   30.0
sum    NaN  300.0

In [15]:
df.agg({'Col_C' : ['sum', 'mean']})

      Col_C
sum   300.0
mean   75.0

In [17]:
df.agg('mean', axis = 'columns')

0     20.0
1     50.0
2     80.0
3    110.0
dtype: float64

In [19]:
df = pd.DataFrame({
    'st_name' : ['Rohan', 'Mohan', 'Sohan'],
    'sub' : ['math', 'sci', 'eng'],
    'marks' : [44, 38, 41]
})
df

  st_name   sub  marks
0   Rohan  math     44
1   Mohan   sci     38
2   Sohan   eng     41

In [20]:
data = {
        'st_name' : ['Rohan', 'Mohan', 'Sohan'],
    'sub' : ['math', 'sci', 'eng'],
    'marks' : [44, 38, 41]    
}
df = pd.DataFrame(data)
df

  st_name   sub  marks
0   Rohan  math     44
1   Mohan   sci     38
2   Sohan   eng     41

In [ ]:
from functools import reduce